//Оператор ЛОГІЧНОЇ УМОВИ (якщо щось, то ми...якщо щось інше, тоді...)
// if - якщо (оператор логічної умови)
/* if - Це спосіб перевірити чи виконується певна умова і взалежності від цього
 зробити певні дії, або виконати певний код.*/

 //----------------------------------------------------------------------
 // Якщо сонце сходить - ви плануєте піти на прогулянку!(умова є істинною)
 // Якщо сонце НЕ сходить - ви залишаєтесь вдома! (УМОВА Є ХИБНОЮ)
 /* 
 if (логічна операція - результатом якої буде тип Boolean {Блок коду у фігурних дужках 
    буде виконуватись тіки в тому випадку якщо тут  буде true}*/

    if(2 + 3 === 5) {
        console.log('Числа рівні між собою'); //Виконається , якщо умова = true;
    }
//if else
//Синтаксис if else
/* if (логічна умова) {Блок коду у фігурних дужках 
    буде виконуватись тіки в тому випадку якщо тут  буде true} 
    else {{Блок коду у фігурних дужках 
    буде виконуватись тіки в тому випадку якщо тут  буде false}*/


 if(2 + 2 === 5) {
        console.log('Числа рівні між собою'); //Виконається , якщо умова = true;
} else {
    console.log('Числа НЕ рівні між собою');
}