

  /*ЗАДАЧА
  
  Ми маємо змінну яка вказує на кількість хвилин в годині.
  Визначити, в якій чверті години знаходиться ця кількість хвилин.
  
  Якщо кількість хвилин попадає в першу чверть години - вивести на консоль "перша чверть".
  Якщо кількість хвилин попадає в другу чверть години - вивести на консоль "друга чверть".
  Якщо кількість хвилин попадає в третю чверть години - вивести на консоль "третя чверть".
  Якщо кількість хвилин попадає в четверту чверть години - вивести на консоль "четверта чверть".*/

  const min = 45; //Підстав інше значення

  if (min >= 0 && min <= 15 ) {
    console.log('"перша чверть"');
  } else if (min >= 15 && min <= 30) {
    console.log('"друга чверть"');
  } else if (min >= 30 && min <= 45) {
    console.log('"третя чверть"');
  } else if (min >= 45 && min <= 60) {
    console.log('"четверта чверть"');
  } else {
    console.log('Виникла помилка')
  }

    

    let str = '1';
    let num = 1;

    if (str === num) {
        console.warn('TRUE')
    } else {
        console.warn('FALSE')
    }

/*ЗАДАЧА
    Ви зберігаєте у змінній рік.
    Потрібно визначити, чи є цей рік високосним.

    Примітка. Рік є високосним, якщо його номер кратний 4, 
    але не кратний 100, також якщо він кратний 400.*/

    let isLeapYear
    const year = 2016;

    if (
        year % 4 === 0 // якщо його номер кратний 4
        && year % 100 !== 0 // але не кратний 100
        || year % 400 === 0 // також якщо він кратний 400
        ) {
        console.log(year + ' є високосний рік')
    } else {
        console.log(year + ' не є високосний рік')
    }
   

    /*У вас є задане початкове і кінцеве значення діапазону, і також певне число.
    Вам потрібно визначити, чи входить це число в заданий діапазон, чи ні.
    Якщо число знаходить між початковим і кінцевим значенням діапазону (включно), вивести "В діапазоні".
    В іншому випадку вивести "Поза діапазоном", оскільки число знаходиться поза початковим та кінцевим значенням*/

    const startNumber = 5;
    const endNumber = 25;
    const number = 26;
   
    if (number >= startNumber && number <= endNumber) {
        console.log('"В діапазоні"');
    } else { 
      console.log('"Поза діапазоном"')
    }
    

    /*Козак Вус проводить змагання з програмування, в якому беруть участь n людей.
Він вирішив нагородити їх усіх ручками та блокнотами.
Відомо, що Ус має рівно m ручок і k блокнотів.
Визначте, чи може козак Вус нагородити всіх учасників, даючи кожному з них щонайменше 
по одній ручці і одному блокноту.*/

const n = 20; //кількість учасників
const m = 20; //кількість ручок
const k = 50; //кількість блокнотів

if (m >= n && k >= n) {
  console.log('Так, зможе нагородити');
} else {
  console.log('Ні, не зможе нагородити');
}

/*Задача 5.

Ви є організатором розважальної програми і вам потрібно розподілити вхідні квитки на основі віку відвідувачів. 
Вхідні квитки мають різні ціни в залежності від віку відвідувачів. 
Вам потрібно реалізувати таку логіку, яка в залежності від віку відвідувача повертає вартість його квитка згідно наступних умов:

- Діти до 6 років: безкоштовний вхід
- Діти від 6 до 12 років (включно): квиток коштує $10
- Дорослі від 12 років і старше: квиток коштує $20

Якщо дорослий надає документ, що підтверджує його право на пільги, 
то такому дорослому надається знижка 50% (знижка для всіх дорослих фіксована, незалежно від виду пільги).*/

const age = 10; // Вік відвідувача
const hasDiscount = true; //Наявність знижки у дорослого
let ticketPrice;// Зараз тут undefined ===> тепер тут число!


if (age < 0 || typeof age !== 'number'){ //Якщо вік < 0 АБО вік НЕ є числом
   console.log('Ви ввели некоректний вік користувача. Спробуйте ще раз')
}  else if ( age <= 6) {
  ticketPrice = 0;
} else if ( age <=12) {
  ticketPrice = 10;
} else if (hasDiscount === false) {// або записати  (!hasDiscount) 
  ticketPrice = 20;
} else {
  ticketPrice = 20 / 2; //поділити на 2 так як скидка 50%
}

if (ticketPrice !== undefined) {
  console.log('Вартість квитка складає: ' + ticketPrice + '$')
}

/* 
    Створіть три змінні isSunny, temperature та isWeekend.
    Присвойте їм логічні значення. 
    Виведіть повідомлення про те, 
    чи можна йти на прогулянку за таких умов: 
    якщо сонячно і температура вище 20 градусів Цельсія 
    або якщо вихідний день.*/





    




