/*
задача: Зберегти розклад занять, використовуючи дні тижня, як клчюі , а знаечннями будуть списки занять 
*/

const schedule = new Map();

schedule.set('Понеділок', ['Математика', 'Фізика']);
schedule.set('Вівторок', ['Англійська мова', 'Всесвітня Історя']);
schedule.set('Середа', ['Хімія', 'Географія']);
schedule.set('Четвер', ['Зарубіжна література', 'Біологія']);
schedule.set('П\'ятниця', ['Інформатика', 'Фізкультура']);

// Отримання розкладу занять для певного дня
console.log(schedule.get('Понеділок'));



// Перевірка, чи є  розклад занять для певного дня

console.log(schedule.has('Субота'))  //false

// Отримання кількості днів в розкладі

console.log(schedule.size);
