// 1. () - Оператор виклику функції
console.log()

// 2. () - для групування виразів. Можемо вказувати пріоритети виконання арифмет операцій

const sum = (2 + 2) * 6; //беручи в дуєки ми змінюємо пріоритет 
console.log(sum);

//Екранування
// Задача. Створиту змінну з цитатою

const hello = 'Маша сказала: "Привіт"';  
//одинарні лапки відкривають/закривають строку
//подвійні для прямої мови 

console.log(hello);

/*Екранування (escape)- коли ми використ спец символи,
 або послідовності символів для вставки недопустимих символів у рядок
 Екранування з допомогою '\' */

 const helloEscape = 'Маша сказала: \'Привіт\'';  //метод вирішення - екранування!
 console.log(helloEscape);

 //Перенос рядка \n (Не обов'язково)

 const test = '-Мені сьогодні прийшла зарплта, а тобі? \n- Мені також прийшла, чудово!';
 console.log(test);