
/* 

LOOPS - Цикли

while (кількість _консоль_логів < 10) {
  console.log(1);
  кількість консоль_логів++ (збільшуєм на 1);
}

*/

// let iterator = 0;

// while (iterator < 10) {
//   console.log(1);
//   iterator++; //інкремени, збільшення на 1
// }
 
// Нескінченний цикл, якщо не ввести слово  break!!!
while (true) {
  console.log('Не вірно')
  break;
}

// ЗАДАЧА: зробити 10 повторів (ітерацій циклу і вивести на консоль парні значення лічильника)

let i = 0;

while ( i < 10) {
  if (i % 2 === 0) {
    console.log(i);
  }
  i++; // Для контролю його значення (збільшуємо або зменшуємо) або і +=2 
}
