// Increment (збільшення), decrement(зменшення)

let superNumber = 1;

//Задача: збільшити значення змінної superNumber на 1.

superNumber++; // 1 + 1 = 2
//Значення збільшується на 1

// Increment - Операція, яка використ для збільшення числа на 1
// Decrement - Операція, яка використ для зменшення числа на 1

superNumber--; // 1 - 1 = 0
 //Значення зменшується на 1

 //-------------------------------------------

 //  Prefix
 ++superNumber; // Iнкремент буде виконано першим ділом, потім всі інші операції
 --superNumber; // Декремент буде виконано першим ділом, потім всі інші операції
 

 //  Postfix
 //  Postfix

  superNumber++;// Спочатку буде використано значення змінної, а після завершення операції мінна інкрементується
  superNumber--; // Спочатку буде використано значення змінної, а після завершення операції змінна декрементується

  console.log(++superNumber); // 1 + 1 = 2

  //------------------------------------------

  //Збільшення НЕ на 1 (> 1)

  let k = 0;

  //Задача: Збільшити значення  k на 3

  k = k + 3; // 3

  // Задача: Зменшити значення k на 2

  k = k - 2;  // -2

  //Можна скоротити цю роботу.
  //Задача: Збільшити значення  k на 3

   k += 3; // те саме, що й : k = k + 3
   k -= 2; // те саме, що й : k = k - 2
   k *= 4; // те саме, що й : k = k * 4
   k /= 5; // те саме, що й : k = k / 5

   // Унарні оператори 

   -k;
   +k;
   Number(k);
   String(k);

   // "+" як оператор приведення строки до числа

   let ThisIsNumber = Number ('455');  // Good practice
   //let ThisIsNumber = Number +'455';  Bad practice
   console.log(typeof ThisIsNumber);

/*
Бінарні оператори:
"+" - як оператор додавання
"+" - як оператор конкатенації

Унарний "+" - оператор приведення строки до ЧИСЛА
*/







