/*Функції (Functions) - блок коду , що виконує певні дії при виклику 
Функція може приймати аругменти - значення , які передаються у функцію.
Функція може використовувати аргументи в своїй роботі.
Функція може повертати значення (а може і не повертати)
Функція - це фрагмент програмного коду, до якого можно звернутись з іншого місця програми

Синтаксис функції 

Як оголосити функцію?
function iм'я_Функції (аргумент1, аргумент2) {
  тіло функції
}

Задача: написати функцію, ка буде приймати ім'я користувача: 
строка і буде вітатись із цим користувачем.

*/ 

function greetingUser (userName) {
  // userName - абстракція, на якій ми зав'язуємо логку роботи функції
  // userName - це формальний параметр
  console.log('Hi, ' + userName);
}

// Використання функції
//Параметри, які ви передаєте при виклику функції - це фактичні параметри

greetingUser ('Alex');
greetingUser ('John'); // 'John' - Фактичний параметр
greetingUser ('Sam');
greetingUser ('Solar');
