/*
Мутація - зміна
Мутабельне - що змінюється
Іммутабельне - що не змінюється

*/

const user = {
  name: 'John',
  lastName: 'Doe'
}

user.isHungry = false; 

// Примітивні (String, Number, Boolean, Null, Undefined, Symbol, Bigint) типи НЕ мутабельні

const userName = 'John Doe';

userName.isHungry = false; 


/*
Метод array.splice використовується для зміни вмісту масиву шляхом видалення, 
заміни або додавання нових елементів (мутуючий метод)

array.splice (start, deleteCount,....item починаючи з 3 аргументу...)
start - початковий індекс з якого ми почин змінювати масив
deleteCount - cкільки еоементів потрібно видалити з масиву починаючи зі start
(якщо не вказано, то видаляться всі елементи від start до кінця масиву)

...item.починаючи з 3 елементи можна додавати нові елементи, які будуть вставлені
 на місце видалений елементів
 - видалені елементи методом splice будуть повертатися як новий масив
 якщо deleteCount = 0, то видаляти не треба нічого, аругменти які предаете, вони будуть додаватися
  починаючи зі start індексу
  
  За допомогою сплайс можна :
  1. видаляти потріб кіль-сть елементів починаючи з певної позициї (start)
  2. Вставити потрібну кількість елементів у потрібну позицію масиву, 
  при цьому нічого не видаляючи (видалення елементів може не відбуватись deleteCount = 0)
  3. Вставити і видаляти елементи одночасно, починаючи з певної позиції (start)
  */


// Задача 1: Починаючи з 2 індексу видали один елемент
  const arr = [1,2,3,4,5] ; 

  // console.log(arr.splice(2,1));  //[1,2,4,5] (повертає масив з видаленим елементом[3])
  (arr.splice(2,2));

   // splice (M,L);
   // M - з якого індекса починати
   // L - скільки елем видалити

   // Задача 2: Після 2 додати рядок "hello" . Нічого не видаляючи

   arr.splice (2,0, 'hello', 'John', 'Doe'); // [1, 2, 'hello', 'John', 'Doe', 5]

   // // Задача 3: Починаючи з 2 індексу видалити 3 елементи і вставити числа 4, 5

   console.log(arr.splice(2, 3, 3, 4));
   