
//Задача. Всередині Alert виконати математичний розрахунок: 2 + 2 = 4

// alert ('2 + 2 = ' + (2 + 2)); 

// Подвійні лапки: "Привіт"
// Одинарні лапки: 'Привіт'

// Зворотні лапки: `Привіт` - мають розширену функціональність 
// Вирази укладаються в $ {...вираз...}
// Рядки , які знаходяться у взоротніх лапках `` називаються шаблонними

// const nickName = 'Вася';

// // Задача: створити Alert і привітатись з Васею

// // alert ('Привіт,' + nickName + '!'); //Ми можемо скоротити цей вираз з допомогою зворотніх лапок

// // alert (`Привіт , ${nickName}!`);

// // alert (`результат: ${1+2}`);

// // Запитати у користувача 2 числа і вивести alert

// const first = Number(prompt ('Enter first number'));
// const second = Number(prompt ('Enter second number'));

// // alert(String (first) + '+' + String (second) + '=' + String (first + second)); // 5 + 10 = 15

// alert (`${first} + ${second} = ${first + second}`);
