'use strict';

/* 
spread operator - розпаковувати елементи масиву, і використовувати це окремо
[] --> .., .., .., .., ..,
взяти кожен елемент з масиву і використовувати їх окремо

*/

const numbers = [1, 2, 3, 4, 5];

function sum (a, b, ...restArray) {
    console.log(restArray);
    return a + b;  // 1,2,3,4,5undefined (конкатенація)
}

// console.log(sum(numbers[0])); //Але це довго!


console.log(sum(...numbers)); //розпаковуємо всі значення всредеину йункції суми
// ми розпакували всі значення в виклик функції sum

// Як розрізняти ці ... 2 однакових оператори?
// Якщо оператор стоїть в аргументах то це  - rest (збирає всі залишки параметрів)
// Якщо ми використовуємо оператор на масиві то це - spread (розбиває масив на купу елементів)

// Приклад використання spread operator #1

const numbersMath = [2, 3, 1, 5, 4];

Math.min(...numbersMath); //1

// Приклад використання spread operator #2


//Задача: зробити масив з назвою copyArray в який будуть входити всі елементи з масиву numbersMath

const copyArray = [...numbersMath]; 

// дозволяє скопіювати елементи з одного масиву в інший! (створює поверхневу копію, посилання на об'єкти одні і ті самі)



