//Оператор ЛОГІЧНОЇ УМОВИ (якщо щось, то ми...якщо щось інше, тоді...)
// if - якщо (оператор логічної умови)
/* if - Це спосіб перевірити чи виконується певна умова і взалежності від цього
 зробити певні дії, або виконати певний код.*/

 //----------------------------------------------------------------------
 // Якщо сонце сходить - ви плануєте піти на прогулянку!(умова є істинною)
 // Якщо сонце НЕ сходить - ви залишаєтесь вдома! (УМОВА Є ХИБНОЮ)
 /* 
 if (логічна операція - результатом якої буде тип Boolean {Блок коду у фігурних дужках 
    буде виконуватись тіки в тому випадку якщо тут  буде true}*/

    if(2 + 3 === 5) {
        console.log('Числа рівні між собою'); //Виконається , якщо умова = true;
    }
//if else
//Синтаксис if else
/* if (логічна умова) {Блок коду у фігурних дужках 
    буде виконуватись тіки в тому випадку якщо тут  буде true} 
    else {{Блок коду у фігурних дужках 
    буде виконуватись тіки в тому випадку якщо тут  буде false}*/


 if(2 + 2 === 5) {
        console.log('Числа рівні між собою'); //Виконається , якщо умова = true;
} else {
    console.log('Числа НЕ рівні між собою');
}

//------------------------------------------------------------------------
/* 
if - else if - else

Синтаксис

if (умова 1) {
    Блок коду виконається , якщо умова 1 = true
} else if (Умова 2)
{Блок коду виконається , якщо умова 2 = true
} else {
    Блоу коду , який виконається, якщо умова 1 та умова 2 =  false
}

*/

//Задача
/*Дано число r.
Якщо r > 12 - вивести в консоль 'більше 12'.
В противному випадку, якщо r < 5 - вивести в консоль 'менше 5'.
В противному випадку - вивести 'в діапазоні між 5 і 12'.*/

let r = 6;

if ( r > 12){
    console.log('більше 12')
} else if (r < 5) {
    console.log('менше 5')
} else {
    console.log('в діапазоні між 5 і 12');
}