// Математичні оператори
// Типовий приклад бінарних оператори, коли потрібно тільки 2 операнти: 
let a = 2 + 2; //4
let b = 2 - 2; //0
let c = 2 * 2; //4
let d = 2 / 2; //1

//  Унарні оператори, коли потрібен тільки 1 оперант

let e = -2;

// % - ЗАЛИШОК від цілочисельного поділу

// число яке лишається після того як одне ціле число ділиться на друге ціле без залишку

/* Задача 1
Дано:
Тістечок - 12 
Друзі - 3
Розділити порівну - ?

Рішення: 
12 / 3 = 4 (тістечка) - БЕЗ залишку!!! 
Це цілочисельне ділення.Залишок - 0 

Задача 2

Дано:
Тістечок - 15 
Друзі - 6
Розділити порівну - ?
Рішення:

1) 15 / 6 = 2.5 
Ціла частина це - 2 (Кожен друг а їх 6 отримають ГАРАНТОВАНО по 2 тістечка 
    2) 6*2=12 тістечок))
3) 15 - 12 = 3 тістечка (ЗАЛИШОК)

Число 2 - це результат цілочисельного поділу(скільки тістечок отримає кожен друг без залишку)
Число 3 - це ЗАЛИШОК від цілочисельного поділу

Залишок від цілочисельного поділу - це число, яке лишається після того, 
як одне ціле число ділиться на інше ціле число без залишку! 
Скільки разів одне число влізе в інше число ЦІЛУ кількість разів
*/

//Вирішення Задачі 2 з використанням спец оператору!
 
let rest = 15 % 6;

console.log(rest);

// Задача: Визначити парність/непарність числа
//Чи є число 4 парним числом

let pair = 4 % 2; // Залишок = 0 парне число
console.log(pair);

let unpair = 5 % 2; //Залишок =1  непарне число
console.log(unpair);

// ОПЕРАТОР СТЕПІНЬ ** 
  
//Задача : піднести 2 у 3 ступінь (2^3)
  
//  const x3 = 2 * 2 * 2; //Але це не зручно, якщо в 9 степінь???
 const x3 = 2 ** 9; 
 console.log(x3);