//Оператор ЛОГІЧНОЇ УМОВИ (якщо щось, то ми...якщо щось інше, тоді...)
// if - якщо (оператор логічної умови)
/* if - Це спосіб перевірити чи виконується певна умова і взалежності від цього
 зробити певні дії, або виконати певний код.*/

 //----------------------------------------------------------------------
 // Якщо сонце сходить - ви плануєте піти на прогулянку!(умова є істинною)
 // Якщо сонце НЕ сходить - ви залишаєтесь вдома! (УМОВА Є ХИБНОЮ)
 /* 
 if (логічна операція - результатом якої буде тип Boolean {Блок коду у фігурних дужках 
    буде виконуватись тіки в тому випадку якщо тут  буде true}*/

    if(2 + 3 === 5) {
        console.log('Числа рівні між собою'); //Виконається , якщо умова = true;
    }
//if else
//Синтаксис if else
/* if (логічна умова) {Блок коду у фігурних дужках 
    буде виконуватись тіки в тому випадку якщо тут  буде true} 
    else {{Блок коду у фігурних дужках 
    буде виконуватись тіки в тому випадку якщо тут  буде false}*/


 if(2 + 2 === 5) {
        console.log('Числа рівні між собою'); //Виконається , якщо умова = true;
} else {
    console.log('Числа НЕ рівні між собою');
}


/*Задача 
1. Створити змінні
a = 3;
b = 6;
n = 8;

2. Якщо b - парне (четное, націло ділиться на 2), тоді n збільшити на 5 (n += 5), у іншому випадку змінну a зробити = 15

3. Вивести значення змінних у консоль*/

let a = 3;
let b = 6;
let n = 8;

if ( b % 2 === 0) { // else НЕ спрацював
    n +=5
} else {
    a = 15
}

console.log({a, b, n}) // Щоб вивести декілька одночасно