//Унарні, бінарні , тернарні
/*ТЕРНАРНИЙ потребує 3 операндів 

Дозволяє вибирати 1 з 2 операндів на основі заданої умови

let result - умова ? операнд1 : операнд2; 
 
операнд1 = значення для змінної result, якщо умова буде true
операнд2 = значення для змінної result, якщо умова буде false

*/

// const age = 28;

// //Задача: реалізувати обмеження, щоб особи які не досягли 18 років, не могли купувати алкоголь та тютюнові вир

// const isAdalt = age > 18 ? true : false;

// console.log(isAdalt);

/*Створіть булеву змінну isAuth, в якій визначте чи авторизований користувач чи ні
Створіть змінну viewMode, яка у випадку авторизованного користувача маж містити рядок 'authMode',
а у випадку не авторизованного користувача - 'unauth'. (тернарний оператор)*/

// const isAuth = true;

// const viewMode = isAuth === true ? 'authMode' : 'unauth'; //можна скоротити  до isAuth


// console.log(viewMode);

 //Задача 2
 /* Потрібно перевірити входження числа у діапазон (з використанням тернарного оператора)
 якщо входить в діапазон від 6 до 12, то у змінній має міститись рядок "in"
 в протилежному випадку рядок "out"
  */
 const number = 11;
 const result = (number >= 6 && number <= 12) ? "in" : "out";
 console.log(result);