// Оператор - || ("або")
// Логічний, бінарний оператор, повертає Boolean
// Повертає істину (true), якщо хоча б один з операндів є істинним. 
// Якщо хоча б один є true то далі не йде!

 /*
 Задача: Якщо у нас вихідні або свято, то це чудовий день для відпочинку
 Зробити висновок.
 */

 const isWeekend = false;
 const isHoliday = false;

 if (isWeekend || isHoliday)//isWeekend === true || isHoliday === true (короткий запис)
  {
    console.log('Чудовий день для відпочинку');
 } else {
    console.log('Треба працювати');
 }