/* Задача 1.

Дано масив [3, 6, 8, 2, 3, 5, 1].
Напишіть функцію, яка приймає масив 
в якості аргументу і повертає суму 
всіх елементів масиву
*/


// const array = [3, 6, 8, 2, 3, 5, 1];

// function returnSum (array) {
//   let sum = 0; // змінна , де накопичуємо суму

//   for (let i = 0; i< array.length; i++){

//     sum += array[i]; // накопичення суми +

//   }
//   return sum; // повернення результату


// }

// console.log(returnSum(array));


/* Задача 2

Дано масив [3, 6, 8, 2, 3, 5, 1].
Написати функцію, яка знаходить найбільше значення серед елементів масиву.

1. Десь запам'ятати найбільше число, яке ми зустріли
2. Порівняти його з наступним елементом масиву.
Якщо елемент масиву опииться більшим ніж те число, яке ми запам'ятали, то саме цей елемент масиву стає найбільшим запам'ятовуваним


const numMaximum = 5;
const currentNum = 4;

if(numMaximum > currentNum) {
  // ідемо далі
} else {
  numMaximum = currentNum;
}

*/


// const NumbersArr = [3, 6, 8, 2, 3, 5, 1];

// const NumbersArr1 = [3, 21, 8, 2, 3, 19, 1];

// function MaxValue(arr) {

//   let maxValue = arr[0];  // Припускаємо, що перший елемент є найбільшим
  
//   for (let i = 0; i < arr.length; i++) { // Перебираємо масив, щоб перевірити!

//     if (arr[i] > maxValue) { // якщо поточний перегладаємий елемент масиву більше ніж макс число , яке ми запамятали, то ми перезаписуємо число

//       maxValue = arr[i]; // Якщо знаходимо більший елемент, оновлюємо maxValue
//     }
//   }

//   return maxValue;
// }


// // const maxNum = MaxValue(arr); 

// // console.log(maxNum);

// console.log(MaxValue(NumbersArr));

// console.log(MaxValue(NumbersArr1));


/* Задача 3

Написати функцію, яка знаходить середнє арифметичне всіх елементів масиву.
Середнє арифметичне = сума всіх елементів масиву / кількість елементів масиву

[3, 6, 8, 2, 3, 5, 1] // 4

*/


const arr = [3, 6, 8, 2, 3, 5, 1]

function findAverage(arr) {

  let sum = 0; //Тут буде накопичуватись сума (спочатку вона = 0)

  for (let i = 0; i < arr.length; i++) {
    sum += arr[i];  // Накопичення суми  
  }

  // const average = sum / arr.length; // суму , яку знайшли ділимо на довжину масива (можна скоротити цей запис, щоб не створювати ще одну змінну)

  return sum / arr.length; //Дія ділення виноситься за цикл for
}

console.log(findAverage(arr));